<?xml version="1.0" ?>
<net name="saved_model" version="10">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,1,28,28"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Copy_StatefulPartitionedCall/mnist/quantize_layer/AllValuesQuantize/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1,1,1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Copy_StatefulPartitionedCall/mnist/quantize_layer/AllValuesQuantize/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="1,1,1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Copy_StatefulPartitionedCall/mnist/quantize_layer/AllValuesQuantize/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_496/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1,1,1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Copy_StatefulPartitionedCall/mnist/quantize_layer/AllValuesQuantize/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_498/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="1,1,1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/mnist/quantize_layer/AllValuesQuantize/FakeQuantWithMinMaxVars" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/mnist/quant_conv2d/LastValueQuant/FakeQuantWithMinMaxVarsPerChannel/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="8" shape="32,1,5,5" size="3200"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/mnist/quant_conv2d/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/mnist/quant_conv2d/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="3208" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/mnist/quant_conv2d/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/mnist/quant_conv2d/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Copy_StatefulPartitionedCall/mnist/quant_conv2d/MovingAvgQuantize/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="3336" shape="1,1,1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Copy_StatefulPartitionedCall/mnist/quant_conv2d/MovingAvgQuantize/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="3340" shape="1,1,1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Copy_StatefulPartitionedCall/mnist/quant_conv2d/MovingAvgQuantize/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_512/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="3336" shape="1,1,1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Copy_StatefulPartitionedCall/mnist/quant_conv2d/MovingAvgQuantize/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_514/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="3340" shape="1,1,1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/mnist/quant_conv2d/MovingAvgQuantize/FakeQuantWithMinMaxVars" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/mnist/quant_max_pooling2d/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="same_upper" kernel="2,2" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/mnist/quant_conv2d_1/LastValueQuant/FakeQuantWithMinMaxVarsPerChannel/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="3344" shape="32,32,5,5" size="102400"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/mnist/quant_conv2d_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/mnist/quant_conv2d_1/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="105744" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/mnist/quant_conv2d_1/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/mnist/quant_conv2d_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Copy_StatefulPartitionedCall/mnist/quant_conv2d_1/MovingAvgQuantize/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="105872" shape="1,1,1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Copy_StatefulPartitionedCall/mnist/quant_conv2d_1/MovingAvgQuantize/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="105876" shape="1,1,1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Copy_StatefulPartitionedCall/mnist/quant_conv2d_1/MovingAvgQuantize/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_492/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="105872" shape="1,1,1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Copy_StatefulPartitionedCall/mnist/quant_conv2d_1/MovingAvgQuantize/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_494/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="105876" shape="1,1,1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/mnist/quant_conv2d_1/MovingAvgQuantize/FakeQuantWithMinMaxVars" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/mnist/quant_max_pooling2d_1/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="same_upper" kernel="2,2" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/mnist/quant_max_pooling2d_1/MaxPool/Transpose/Cast_13161_const" type="Const" version="opset1">
			<data element_type="i64" offset="105880" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/mnist/quant_max_pooling2d_1/MaxPool/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/mnist/quant_flatten/Reshape/Cast_13163_const" type="Const" version="opset1">
			<data element_type="i64" offset="105912" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/mnist/quant_flatten/Reshape" type="Reshape" version="opset1">
			<data special_zero="False"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1568</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/mnist/quant_dense/LastValueQuant/FakeQuantWithMinMaxVars/Convert_to_float/Cast_03159_const" type="Const" version="opset1">
			<data element_type="u8" offset="105928" shape="1024,1568" size="1605632"/>
			<output>
				<port id="1" precision="U8">
					<dim>1024</dim>
					<dim>1568</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/mnist/quant_dense/LastValueQuant/FakeQuantWithMinMaxVars/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>1024</dim>
					<dim>1568</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1568</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/mnist/quant_dense/LastValueQuant/FakeQuantWithMinMaxVars/Copy/out_low2727_const" type="Const" version="opset1">
			<data element_type="f32" offset="1711560" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/mnist/quant_dense/LastValueQuant/FakeQuantWithMinMaxVars/Copy/out_high2728_const" type="Const" version="opset1">
			<data element_type="f32" offset="1711564" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/mnist/quant_dense/MatMul/1_port_transpose22922293_const" type="Const" version="opset1">
			<data element_type="f32" offset="1711568" shape="1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/mnist/quant_dense/MatMul/1_port_transpose22942295_const" type="Const" version="opset1">
			<data element_type="f32" offset="1711572" shape="1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/mnist/quant_dense/LastValueQuant/FakeQuantWithMinMaxVars" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>1024</dim>
					<dim>1568</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1024</dim>
					<dim>1568</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/mnist/quant_dense/MatMul" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1568</dim>
				</port>
				<port id="1">
					<dim>1024</dim>
					<dim>1568</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/mnist/quant_dense/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1711576" shape="1,1024" size="4096"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/mnist/quant_dense/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/mnist/quant_dense/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Copy_StatefulPartitionedCall/mnist/quant_dense/MovingAvgQuantize/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1715672" shape="1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Copy_StatefulPartitionedCall/mnist/quant_dense/MovingAvgQuantize/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1715676" shape="1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Copy_StatefulPartitionedCall/mnist/quant_dense/MovingAvgQuantize/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_516/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1715672" shape="1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Copy_StatefulPartitionedCall/mnist/quant_dense/MovingAvgQuantize/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_518/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1715676" shape="1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/mnist/quant_dense/MovingAvgQuantize/FakeQuantWithMinMaxVars" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/mnist/quant_dense_1/LastValueQuant/FakeQuantWithMinMaxVars/Convert_to_float/Cast_03165_const" type="Const" version="opset1">
			<data element_type="u8" offset="1715680" shape="10,1024" size="10240"/>
			<output>
				<port id="1" precision="U8">
					<dim>10</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/mnist/quant_dense_1/LastValueQuant/FakeQuantWithMinMaxVars/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>10</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>10</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/mnist/quant_dense_1/LastValueQuant/FakeQuantWithMinMaxVars/Copy/out_low2735_const" type="Const" version="opset1">
			<data element_type="f32" offset="1711560" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/mnist/quant_dense_1/LastValueQuant/FakeQuantWithMinMaxVars/Copy/out_high2736_const" type="Const" version="opset1">
			<data element_type="f32" offset="1711564" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/mnist/quant_dense_1/MatMul/1_port_transpose23022303_const" type="Const" version="opset1">
			<data element_type="f32" offset="1725920" shape="1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/mnist/quant_dense_1/MatMul/1_port_transpose23042305_const" type="Const" version="opset1">
			<data element_type="f32" offset="1725924" shape="1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/mnist/quant_dense_1/LastValueQuant/FakeQuantWithMinMaxVars" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>10</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>10</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/mnist/quant_dense_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>10</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/mnist/quant_dense_1/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1725928" shape="1,10" size="40"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/mnist/quant_dense_1/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Copy_StatefulPartitionedCall/mnist/quant_dense_1/MovingAvgQuantize/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1725968" shape="1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Copy_StatefulPartitionedCall/mnist/quant_dense_1/MovingAvgQuantize/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1725972" shape="1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Copy_StatefulPartitionedCall/mnist/quant_dense_1/MovingAvgQuantize/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_504/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1725968" shape="1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Copy_StatefulPartitionedCall/mnist/quant_dense_1/MovingAvgQuantize/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_506/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1725972" shape="1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/mnist/quant_dense_1/MovingAvgQuantize/FakeQuantWithMinMaxVars" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/mnist/quant_dense_1/Softmax" type="SoftMax" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Identity/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="5" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="5" to-port="1"/>
		<edge from-layer="2" from-port="1" to-layer="5" to-port="2"/>
		<edge from-layer="3" from-port="1" to-layer="5" to-port="3"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="4"/>
		<edge from-layer="5" from-port="5" to-layer="7" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="7" to-port="1"/>
		<edge from-layer="7" from-port="2" to-layer="9" to-port="0"/>
		<edge from-layer="8" from-port="1" to-layer="9" to-port="1"/>
		<edge from-layer="9" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="15" to-port="0"/>
		<edge from-layer="11" from-port="1" to-layer="15" to-port="1"/>
		<edge from-layer="12" from-port="1" to-layer="15" to-port="2"/>
		<edge from-layer="13" from-port="1" to-layer="15" to-port="3"/>
		<edge from-layer="14" from-port="1" to-layer="15" to-port="4"/>
		<edge from-layer="15" from-port="5" to-layer="16" to-port="0"/>
		<edge from-layer="16" from-port="1" to-layer="18" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="18" to-port="1"/>
		<edge from-layer="18" from-port="2" to-layer="20" to-port="0"/>
		<edge from-layer="19" from-port="1" to-layer="20" to-port="1"/>
		<edge from-layer="20" from-port="2" to-layer="21" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="26" to-port="0"/>
		<edge from-layer="22" from-port="1" to-layer="26" to-port="1"/>
		<edge from-layer="23" from-port="1" to-layer="26" to-port="2"/>
		<edge from-layer="24" from-port="1" to-layer="26" to-port="3"/>
		<edge from-layer="25" from-port="1" to-layer="26" to-port="4"/>
		<edge from-layer="26" from-port="5" to-layer="27" to-port="0"/>
		<edge from-layer="27" from-port="1" to-layer="29" to-port="0"/>
		<edge from-layer="28" from-port="1" to-layer="29" to-port="1"/>
		<edge from-layer="29" from-port="2" to-layer="31" to-port="0"/>
		<edge from-layer="30" from-port="1" to-layer="31" to-port="1"/>
		<edge from-layer="32" from-port="1" to-layer="33" to-port="0"/>
		<edge from-layer="33" from-port="1" to-layer="38" to-port="0"/>
		<edge from-layer="34" from-port="1" to-layer="38" to-port="1"/>
		<edge from-layer="35" from-port="1" to-layer="38" to-port="2"/>
		<edge from-layer="36" from-port="1" to-layer="38" to-port="3"/>
		<edge from-layer="37" from-port="1" to-layer="38" to-port="4"/>
		<edge from-layer="31" from-port="2" to-layer="39" to-port="0"/>
		<edge from-layer="38" from-port="5" to-layer="39" to-port="1"/>
		<edge from-layer="39" from-port="2" to-layer="41" to-port="0"/>
		<edge from-layer="40" from-port="1" to-layer="41" to-port="1"/>
		<edge from-layer="41" from-port="2" to-layer="42" to-port="0"/>
		<edge from-layer="42" from-port="1" to-layer="47" to-port="0"/>
		<edge from-layer="43" from-port="1" to-layer="47" to-port="1"/>
		<edge from-layer="44" from-port="1" to-layer="47" to-port="2"/>
		<edge from-layer="45" from-port="1" to-layer="47" to-port="3"/>
		<edge from-layer="46" from-port="1" to-layer="47" to-port="4"/>
		<edge from-layer="48" from-port="1" to-layer="49" to-port="0"/>
		<edge from-layer="49" from-port="1" to-layer="54" to-port="0"/>
		<edge from-layer="50" from-port="1" to-layer="54" to-port="1"/>
		<edge from-layer="51" from-port="1" to-layer="54" to-port="2"/>
		<edge from-layer="52" from-port="1" to-layer="54" to-port="3"/>
		<edge from-layer="53" from-port="1" to-layer="54" to-port="4"/>
		<edge from-layer="47" from-port="5" to-layer="55" to-port="0"/>
		<edge from-layer="54" from-port="5" to-layer="55" to-port="1"/>
		<edge from-layer="55" from-port="2" to-layer="57" to-port="0"/>
		<edge from-layer="56" from-port="1" to-layer="57" to-port="1"/>
		<edge from-layer="57" from-port="2" to-layer="62" to-port="0"/>
		<edge from-layer="58" from-port="1" to-layer="62" to-port="1"/>
		<edge from-layer="59" from-port="1" to-layer="62" to-port="2"/>
		<edge from-layer="60" from-port="1" to-layer="62" to-port="3"/>
		<edge from-layer="61" from-port="1" to-layer="62" to-port="4"/>
		<edge from-layer="62" from-port="5" to-layer="63" to-port="0"/>
		<edge from-layer="63" from-port="1" to-layer="64" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2021.1.0-1237-bece22ac675-releases/2021/1"/>
		<cli_parameters>
			<data_type value="float"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V7 value="False"/>
			<input_model_is_text value="False"/>
			<input_shape value="[1,28,28,1]"/>
			<keep_shape_ops value="True"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="saved_model"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<placeholder_shapes value="[ 1 28 28  1]"/>
			<progress value="False"/>
			<reverse_input_channels value="False"/>
			<saved_model_dir value="DIR"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<static_shape value="False"/>
			<stream_output value="False"/>
			<unset unset_cli_parameters="batch, disable_fusing, disable_gfusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, input_model, move_to_preprocess, output, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
